thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
/*******************************************************************************
 Copyright (c) 2014, Infineon Technologies AG                                 **
 All rights reserved.                                                         **
                                                                              **
 Redistribution and use in source and binary forms, with or without           **
 modification,are permitted provided that the following conditions are met:   **
                                                                              **
 *Redistributions of source code must retain the above copyright notice,      **
 this list of conditions and the following disclaimer.                        **
 *Redistributions in binary form must reproduce the above copyright notice,   **
 this list of conditions and the following disclaimer in the documentation    **
 and/or other materials provided with the distribution.                       **
 *Neither the name of the copyright holders nor the names of its contributors **
 may be used to endorse or promote products derived from this software without**
 specific prior written permission.                                           **
                                                                              **
 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"  **
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE    **
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   **
 ARE  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE   **
 LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR         **
 CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF         **
 SUBSTITUTE GOODS OR  SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS    **
 INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN      **
 CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)       **
 ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE   **
 POSSIBILITY OF SUCH DAMAGE.                                                  **
                                                                              **
 To improve the quality of the software, users are encouraged to share        **
 modifications, enhancements or bug fixes with Infineon Technologies AG       **
 dave@infineon.com).                                                          **
                                                                              **
********************************************************************************
**                                                                            **
**                                                                            **
** PLATFORM : Infineon XMC4000 Series                                         **
**                                                                            **
** COMPILER : Compiler Independent                                            **
**                                                                            **
** AUTHOR : App Developer                                                     **
**                                                                            **
** MAY BE CHANGED BY USER [yes/no]: No                                        **
**                                                                            **
** MODIFICATION DATE : May 14, 2014     		                                  **
**                                                                            **
*******************************************************************************/

/**
 * @file xmc4_usb.c
 * @version $Id$
 *
 * @brief USB driver definition
 *
 * USB Device Driver.
 *
 * History
 *
 * Version 1.0.0
 *   Initial
 *
 */

#include "xmc4_usb.h"

/*
 *  Global Definitions
*/
uint32_t usb_rx_fifo_packet_size;
uint32_t usb_rx_fifo_size;
uint32_t usb_max_transfer_size;
uint8_t usb_max_num_eps;
bool use_dma=1;
bool use_fifo=0;

/*Priority and sub priority inputs*/
extern uint32_t usb_preemption_priority;
extern uint32_t usb_sub_priority;


/*
 * Transmit Fifo Size
 */
const uint16_t USB_TX_FIFO_SIZE[USB_NUM_TX_FIFOS] = {
	USB_EP0_TX_FIFO_SIZE/4,
	USB_EP1_TX_FIFO_SIZE/4,
	USB_EP2_TX_FIFO_SIZE/4,
	USB_EP3_TX_FIFO_SIZE/4,
	USB_EP4_TX_FIFO_SIZE/4,
	USB_EP5_TX_FIFO_SIZE/4,
	USB_EP6_TX_FIFO_SIZE/4
};

/*
 * Endpoint Out Fifo Size
 */
uint32_t* USBD_EP_OUT_BUFFERSIZE;
/*
 * Endpoint In Fifo Size
 */
uint32_t* USBD_EP_IN_BUFFERSIZE;

/**
 *  The device driver
 */
const USB_DRIVER_USBD_t Driver_USBD0 = {
  .GetCapabilities = USB_GetCapabilities,
  .Initialize = USB_Init,
  .Uninitialize = USB_Uninitialize,
  .DeviceConnect = USB_DeviceConnect,
  .DeviceDisconnect = USB_DeviceDisconnect,
  .DeviceGetState = USB_DeviceGetState,
  .DeviceSetAddress = USB_DeviceSetAddress,
  .EndpointReadStart = USB_EndpointReadStart,
  .EndpointRead = USB_EndpointRead,
  .EndpointWrite = USB_EndpointWrite,
  .EndpointStall = USB_EndpointStall,
  .EndpointAbort = USB_EndpointAbort,
  .EndpointConfigure = USB_EndpointConfigure,
  .EndpointUnconfigure = USB_EndpointUnconfigure,
  .GetFrameNumber = USB_GetFrameNumber,
  .IsEnumDone = USB_IsEnumDone
};

/*
 * Device definition
 */
USB_DEVICE_t xmc_device __attribute__((section("USB_RAM")));


/**
 * \brief Checks if device is active
 *
 * Therefore the endpoint inInUse flag are checked and if one endpoint is in use, 1 is returned, else 0 is returned.
 * \return 1 if an endpoint is active else 0
 */
uint8_t USB_DeviceActive() {
  uint8_t i;
  for (i = 0; i <usb_max_num_eps; i++)
  {
    if (xmc_device.ep[i].inInUse || xmc_device.ep[i].outInUse)
	  return 1;
  }
  return 0;
}

/**
 * \brief Read data from the rx fifo
 *
 * The data from the fifo is copied in to the buffer specified by \ref xfer_buffer and
 * the transfer values get updated. If the endpoint is disabled or the buffer not existent
 * the function exits.
 *
 * @arg ep_num the endpoint to read for
 * @arg byte_count the byte count to read
 */
void USB_ReadFifo(uint32_t ep_num,uint32_t byte_count) {
  xmc_usb_ep_t * ep = &xmc_device.ep[ep_num];
  uint32_t word_count,temp_data;
  volatile uint32_t *fifo = xmc_device.fifo[0];
  int i;
  depctl_data_t data = { xmc_device.endpoint_out_register[ep_num]->doepctl };
  word_count = (byte_count >> 2 );

  /* Check if ep is enabled and has buffer */
  if (!data.b.usbactep) return;
  if (ep->xferBuffer == NULL) return;
  /* store the data */
  for (i=0;i<word_count;i++)
    *(((uint32_t*)ep->xferBuffer)+i) = *fifo;

  /* space is not devidable by 4 */
  if (byte_count!=(word_count<<2))
  {
    temp_data = *fifo;
    for (i=0;byte_count > (word_count << 2)+i;i++)
      ep->xferBuffer[(word_count << 2)+i] = (temp_data & ((uint32_t)0xFF << i*8)) >> i*8;
  }

  /* save the amount of data */
  ep->xferCount += byte_count;
  ep->xferBuffer += byte_count;
}

/**
 * \brief Write data to an endpoint fifo
 *
 * The data from the \ref xfer_buffer gets copied in to the tx fifo of the endpoint until the buffer has been read
 * completely or the tx fifo is full. The transfer values are not updated.
 *
 * @arg[in] ep the endpoint to use
 * @return the number of bytes written to the fifo
 */
uint32_t USB_WriteFifo(xmc_usb_ep_t * ep) {
  dtxfsts_data_t freeSpace = { .d32 = xmc_device.endpoint_in_register[ep->number]->dtxfsts };
  volatile uint32_t *fifo = xmc_device.fifo[ep->number];
  uint32_t byte_count;
  uint32_t word_count;
  uint32_t i;

  /* calculate the length and the amount of dwords to copy based on the fifo status */
  byte_count = ep->xferLength - ep->xferCount;
  if (!byte_count)
    return 0;

  /* add the unaligned bytes to the word count to compare with the fifo space */
  word_count = (byte_count + 3) >> 2;
  if (word_count > freeSpace.b.txfspcavail )
  {
    word_count = freeSpace.b.txfspcavail;
    byte_count = word_count << 2;
  }

  /* copy data dword wise */
  for (i=0;i<word_count;i++,ep->xferBuffer+=4)
    *fifo = *(uint32_t*)ep->xferBuffer;

  return byte_count;
}

/**
 * \brief Flush a tx fifo
 *
 * \param[in] fifo_num Fifo number to flush
 *
 * \note Use 0x10 as parameter to flush all tx fifos.
 */
void USB_FlushTXFifo(uint8_t fifo_num) {
  volatile grstctl_t data = { .d32 = 0};
  uint32_t count;

  /*flush fifo */
  data.b.txfflsh = 1;
  data.b.txfnum = fifo_num;
  xmc_device.global_register->grstctl = data.d32;
  for (count=0;count<1000;count++);
    do
    {
    data.d32 = xmc_device.global_register->grstctl;
    } while (data.b.txfflsh);
    count = 0;
  while (count++ < 1000); /* wait 3 phy clocks */
}

/**
 * \brief Flush the rx fifo
 */
void USB_FlushRXFifo() {
  volatile grstctl_t data = { .d32 = 0};
  uint32_t count;
  data.b.rxfflsh = 1;

  /*flush fifo */
  xmc_device.global_register->grstctl = data.d32;
  do
  {
    for (count=0;count<1000;count++);
    data.d32 = xmc_device.global_register->grstctl;
  } while (data.b.rxfflsh);
  count = 0;
  while (count++ < 1000); /* wait 3 phy clocks */
}


