thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
/*
 * Support Functions
 */

/**
 * \brief Assign a free tx fifo
 *
 * A free tx fifo will be searched and the number will be returned.
 *
 * \return Fifo number for a free fifo
 */
uint8_t USB_AssignTXFifo() {
  uint16_t mask = 1;
  uint8_t i;
  for (i=0; i< USB_NUM_TX_FIFOS; i++)
  {
    if ((xmc_device.txfifomsk & mask) == 0)
    {
      xmc_device.txfifomsk  |=mask;
    return i;
    }
		mask <<= 1;
	}
	return 0;
}

/**
 * \brief Free a tx fifo
 *
 * Mark an used tx fifo as free.
 * \param[in] fifo_nr Fifo number to free
 */
void USB_UnassignFifo(uint8_t fifo_nr) {
  xmc_device.txfifomsk &= ~((1<<fifo_nr));
}

/**
 * \brief Start a transfer for an out endpoint
 *
 * Based on the transfer values of the endpoint, the out endpoint registers will be programmed
 * to start a new out transfer.
 *
 * \note No checking of the transfer values are done in this function. Be sure,
 * that the transfer values are reasonable (e.g. buffer size is not exceeded).
 *
 * \param[in] ep Endpoint to start the transfer
 */
void USB_StartReadXfer(xmc_usb_ep_t * ep) {
  deptsiz_data_t data = {.d32 = 0};
  if ((ep->xferTotal - ep->xferLength) > ep->maxTransferSize)
    ep->xferLength += ep->maxTransferSize;
  else
	ep->xferLength = ep->xferTotal;
  if (ep->number==0)
  {
		/* Setup the endpoint to receive 3 setup packages and one normal package.
		 * Cast the data pointer to use only one variable */
    deptsiz0_data_t *ep0_data = (deptsiz0_data_t*)&data;
    ep0_data->b.pktcnt = 0x1;
    ep0_data->b.supcnt = 0x3;
    ep0_data->b.xfersize = ep->xferTotal;
	}else
	{
    /* If requested length is zero, just receive one zero length packet */
    if (ep->xferLength==0)
    {
      data.b.xfersize = 0;
      data.b.pktcnt = 1;
    } else
    {
    /* setup endpoint to recive a amount of packages by given size */
    data.b.pktcnt = ((ep->xferLength - ep->xferCount) + ep->maxPacketSize -1)/ep->maxPacketSize;
    data.b.xfersize = (ep->xferLength - ep->xferCount);
	}
  }
  if(use_dma)
  {
	/* Programm dma address if needed */
	xmc_device.endpoint_out_register[ep->number]->doepdma = (uint32_t)ep->xferBuffer;
  }
  /* setup endpoint size and enable endpoint */
  xmc_device.endpoint_out_register[ep->number]->doeptsiz = data.d32;
  depctl_data_t epctl = { .d32 = xmc_device.endpoint_out_register[ep->number]->doepctl };
  epctl.b.cnak = 1;
  epctl.b.epena = 1;
  xmc_device.endpoint_out_register[ep->number]->doepctl = epctl.d32;
}

/**
 * \brief Start a new in transfer
 *
 * Based on the transfer values of the endpoint the in endpoint registers will be programmed
 * to start a new in transfer
 *
 * \param[in] ep Endpoint to start the transfer
 */
void USB_StartWriteXfer(xmc_usb_ep_t * ep) {
  deptsiz_data_t size = { .d32 = 0 };
  depctl_data_t ctl = { .d32 = xmc_device.endpoint_in_register[ep->number]->diepctl };

  if (ep->xferTotal - ep->xferLength  < ep->maxTransferSize)
    ep->xferLength = ep->xferTotal;
  else
    ep->xferLength += ep->maxTransferSize;

  if (ep->xferLength==0)
  {
    size.b.xfersize = 0;
    size.b.pktcnt = 1;
  }
  else
  {
    if (ep->number==0)
    {
      size.b.pktcnt = 1;
      size.b.xfersize = ep->xferLength - ep->xferCount; /* ep->maxXferSize equals maxPacketSize */
    }
    else
    {
     size.b.xfersize = ep->xferLength - ep->xferCount;
     size.b.pktcnt = (ep->xferLength - ep->xferCount + ep->maxPacketSize -1)/ep->maxPacketSize;
    }
    if(use_dma)
    {
	  /* programm dma*/
	  xmc_device.endpoint_in_register[ep->number]->diepdma = (uint32_t)ep->xferBuffer;
    }
    if(use_fifo)
    {
	  /* enable fifo empty interrupt */
	  xmc_device.device_register->dtknqr4_fifoemptymsk |= (1 << ep->number);
    }
  }

  /* programm size of transfer and enable endpoint */
  xmc_device.endpoint_in_register[ep->number]->dieptsiz = size.d32;
  ctl.b.epena = 1;
  ctl.b.cnak = 1;
  xmc_device.endpoint_in_register[ep->number]->diepctl = ctl.d32;
}


/**
 * \brief Handles the USB reset interrupt
 *
 * When ever the host sets the bus into reset condition the usb otg_core generates
 * an interrupt, which is handled by this function. It resets the complete otg_core
 * into the default state.
 */
void USB_HandleUSBReset() {
  int i;
  depctl_data_t epctl;
  dctl_data_t dctl;
  /* Clear the Remote Wakeup Signaling */
  dctl.d32 = xmc_device.device_register->dctl;
  dctl.b.rmtwkupsig = 1;
  xmc_device.device_register->dctl = dctl.d32;

  /* enable naks for all eps */
  for (i=0;i<USB_NUM_EPS;i++)
  {
    epctl.d32 = xmc_device.endpoint_out_register[i]->doepctl;
	epctl.b.snak = 1;
	epctl.b.stall = 0;
	xmc_device.endpoint_out_register[i]->doepctl = epctl.d32;
  }

  /* Configure fifos */
  /* Calculate the size of the rx fifo */
  xmc_device.global_register->grxfsiz =usb_rx_fifo_size ;
  /* Calculate the size of the tx fifo for ep 0 */
  fifosize_data_t gnptxfsiz = { .d32 = 0 };
  gnptxfsiz.b.depth = USB_TX_FIFO_SIZE[0];
  gnptxfsiz.b.startaddr = usb_rx_fifo_size;
  xmc_device.global_register->gnptxfsiz = gnptxfsiz.d32;

  /* calculate the size for the rest */
  fifosize_data_t dtxfsiz = { .b.depth = USB_TX_FIFO_SIZE[1], .b.startaddr = usb_rx_fifo_size + USB_TX_FIFO_SIZE[0]};
  for (i=1;i<USB_NUM_TX_FIFOS;i++)
  {
    xmc_device.global_register->dtxfsiz[i-1] = dtxfsiz.d32;
	/* leave loop for overrun protection */
	if (i==USB_NUM_TX_FIFOS-1)
	  break;
	dtxfsiz.b.depth = USB_TX_FIFO_SIZE[i+1];
	dtxfsiz.b.startaddr += USB_TX_FIFO_SIZE[i];
  }

  /* flush the fifos for proper operation */
  USB_FlushTXFifo(0x10); /* 0x10 == all fifos, see doc */
  USB_FlushTXFifo(0x0);
  USB_FlushRXFifo();
  /* Flush learning queue not needed due to fifo config */

  /* enable ep0 interrupts */
  daint_data_t daint = { .d32 = 0 };
  daint.b.inep0 = 1;
  daint.b.outep0 = 1;
  xmc_device.device_register->daintmsk = daint.d32;

  /* enable endpoint interrupts */
  /* out ep interrupts */
  doepint_data_t doepint = { .d32 = 0 };
  doepint.b.setup = 1;
  doepint.b.xfercompl = 1;
  doepint.b.ahberr = 1;
  doepint.b.epdisabled = 1;
  xmc_device.device_register->doepmsk = doepint.d32;

  /*in ep interrupts */
  diepint_data_t diepint = { .d32 = 0 };
  diepint.b.timeout = 1;
  diepint.b.xfercompl = 1;
  diepint.b.ahberr = 1;
  diepint.b.epdisabled = 1;
  xmc_device.device_register->diepmsk = diepint.d32;

