thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
  /* Clear device Address */
  dcfg_data_t dcfg;
  dcfg.d32 = xmc_device.device_register->dcfg;
  dcfg.b.devaddr = 0;
  xmc_device.device_register->dcfg = dcfg.d32;
  if(use_fifo)
  {
	/* Clear Empty interrupt */
	xmc_device.device_register->dtknqr4_fifoemptymsk = 0;
  }

  xmc_device.ep[0].outInUse = 0;
  xmc_device.ep[0].inInUse = 0;

  xmc_device.DeviceEvent_cb(USB_USBD_EVENT_RESET);

  /* clear reset intr */
  gintsts_data_t gintsts = { .d32 = 0 };
  gintsts.b.usbreset = 1;
  xmc_device.global_register->gintsts = gintsts.d32;
}

/**
 * \brief Interrupt handler for device enumeration done.
 *
 * Handles the enumeration done from dwc_otg, when the host has enumerated the device.
 */
void USB_HandleEnumDone() {
  /* Normaly we need to check dctl
   * We are always fullspeed, so max it up. */
  depctl_data_t epctl = { .d32 = xmc_device.endpoint_in_register[0]->diepctl };
  epctl.b.mps = 0x00; /* 64 Byte, this is also automatically set for out ep */
  xmc_device.endpoint_in_register[0]->diepctl = epctl.d32;

  /* update device connected flag */
  xmc_device.IsConnected = 1;
  xmc_device.IsPowered = 1;

  xmc_device.DeviceEvent_cb(USB_USBD_EVENT_CONNECT);

  /* Set Trim */
  gusbcfg_data_t gusbcfg = { .d32 = xmc_device.global_register->gusbcfg };
  gusbcfg.b.usbtrdtim = 9; /* default value for LS/FS */
  xmc_device.global_register->gusbcfg = gusbcfg.d32;

  /* clear interrupt */
  gintsts_data_t gintsts = { .d32 = 0  };
  gintsts.b.enumdone = 1;
  xmc_device.global_register->gintsts = gintsts.d32;
}


/**
 * \brief Handles all interrupts for all out endpoints
 *
 * The interrupt handler first checks, which endpoint has caused the interrupt and then
 * determines, which interrupt should be handled.
 */
void USB_HandleOEPInt() {
  daint_data_t daint = { .d32 = xmc_device.device_register->daint };
  daint_data_t daintmsk = { .d32 = xmc_device.device_register->daintmsk };
  doepmsk_data_t doepmsk = { .d32 = xmc_device.device_register->doepmsk };
  doepint_data_t doepint;
  doepint_data_t clear;
  deptsiz_data_t doeptsiz;
  xmc_usb_ep_t *ep;
  uint16_t mask = daint.ep.out & daintmsk.ep.out;
  uint8_t ep_num = 0;
  while (mask >> ep_num)
  {
    if ((mask >> ep_num) & 1)
    {
      /* load register data for endpoint */
      ep = &xmc_device.ep[ep_num];
      doepint.d32 = xmc_device.endpoint_out_register[ep_num]->doepint & doepmsk.d32;
      if(use_dma)
      {

	    doeptsiz.d32 = xmc_device.endpoint_out_register[ep_num]->doeptsiz;
      }
      /* Setup Phase Complete */
      if (doepint.b.setup)
      {
        /* ep0 not stalled any more */
        ep->isStalled = 0;
        /* calculate size for setup packet */
        if(use_dma)
        {
		  ep->outBytesAvailable = (USB_SETUP_COUNT - ((deptsiz0_data_t*)&doeptsiz)->b.supcnt)*USB_SETUP_SIZE;
        }
        if(use_fifo)
        {
		  ep->outBytesAvailable += ep->xferCount;
        }
        ep->outInUse = 0;
		xmc_device.EndpointEvent_cb(0,USB_USBD_EP_EVENT_SETUP); /* signal endpoint event */
        /* clear the interrupt */
        clear.d32 = 0;
        clear.b.setup = 1;
        xmc_device.endpoint_out_register[ep_num]->doepint = clear.d32;
      }
      if (doepint.b.xfercompl)
      {
        if(use_dma)
    	{
		  uint32_t bytes = ep->xferLength - ep->xferCount - doeptsiz.b.xfersize;
		  ep->xferCount += bytes;
		  ep->xferBuffer += bytes;
        }
        if (ep->xferTotal==ep->xferLength)
        {
          ep->outBytesAvailable = ep->xferCount;
          ep->outInUse = 0;
          xmc_device.EndpointEvent_cb(ep_num,USB_USBD_EP_EVENT_OUT);
        }
        else
        {
          USB_StartReadXfer(ep);
        }

        /* clear the interrupt */
        clear.d32 = 0;
        clear.b.xfercompl = 1;
        xmc_device.endpoint_out_register[ep_num]->doepint = clear.d32;
      }
      if (doepint.b.epdisabled == 1)
      {
        clear.d32 = 0;
        clear.b.epdisabled = 1;
        xmc_device.endpoint_out_register[ep_num]->doepint = clear.d32;
      }
    }
    ep_num++;

  }

  /* clear interrupt */
  gintsts_data_t gintsts = { .d32 = 0 };
  gintsts.b.outepintr = 1;
  xmc_device.global_register->gintsts = gintsts.d32;
}

/**
 * \brief Handles all interrupts for all in endpoints
 *
 * The interrupt handler first checks, which endpoint has caused the interrupt and then
 * determines, which interrupt should be handled.
 */
void USB_HandleIEPInt() {
  xmc_usb_ep_t *ep;
  daint_data_t daint = { .d32 = xmc_device.device_register->daint };
  diepmsk_data_t diepmsk = { .d32 = xmc_device.device_register->diepmsk };
  diepmsk_data_t clear;
  diepint_data_t diepint;
  deptsiz_data_t dieptsiz;
  uint16_t mask = daint.ep.in;
  uint8_t ep_num = 0;
  while (mask >> ep_num)
  {
    if ((mask >> ep_num) & 0x1)
    {
      ep = &xmc_device.ep[ep_num];
      diepint.d32 = xmc_device.endpoint_in_register[ep_num]->diepint &
      ((((xmc_device.device_register->dtknqr4_fifoemptymsk >> ep->number) & 0x1)<<7) | diepmsk.d32);
      if(use_dma)
  	  {

	    dieptsiz.d32 = xmc_device.endpoint_in_register[ep_num]->dieptsiz;
  	  }

      if(use_fifo)
      {
	    if (diepint.b.emptyintr) {
		  uint32_t bytes;
		  bytes = USB_WriteFifo(ep);
		  ep->xferCount+=bytes;
		  ep->xferBuffer+=bytes;
	    }
      }
      if (diepint.b.xfercompl)
      {
        if (ep_num==1)
          ep_num = 1;
        if(use_dma)
    	{
		   /* update xfer values */
		   if (dieptsiz.b.pktcnt == 0 && dieptsiz.b.xfersize == 0)
		   {
			 uint32_t Bytes = ep->xferLength - ep->xferCount;
			 ep->xferCount += Bytes;
			 ep->xferBuffer += Bytes;
		   }
         }
		 if (ep->xferTotal == ep->xferLength)
		 {
		   ep->inInUse = 0;
		   if(use_fifo)
		   {
		     xmc_device.device_register->dtknqr4_fifoemptymsk &= ~(1 << ep_num); /* mask fifo empty interrupt */
           }
           xmc_device.EndpointEvent_cb(0x80 | ep_num,USB_USBD_EP_EVENT_IN);
          }
          else
          {
            /* start next step of transfer */
            USB_StartWriteXfer(ep);
          }
          clear.d32 = 0;
          clear.b.xfercompl = 1;
          xmc_device.endpoint_in_register[ep_num]->diepint = clear.d32;
      }
      if (diepint.b.timeout == 1 )
      {
        clear.d32 = 0;
        clear.b.timeout = 1;
        xmc_device.endpoint_in_register[ep_num]->diepint = clear.d32;
      }
      if (diepint.b.epdisabled == 1)
      {
        clear.d32 = 0;
        clear.b.epdisabled = 1;
        xmc_device.endpoint_in_register[ep_num]->diepint = clear.d32;
      }
    }
    ep_num++;
  }
  gintsts_data_t gintsts = { .d32 = 0 };
  gintsts.b.inepint = 1;
  xmc_device.global_register->gintsts = gintsts.d32;
}

/**
 * \brief RX Fifo interrupt handler
 *
 * This function handles the interrupt, when the rx fifo is not empty anymore.
 */
void USB_HandleRxFLvl() {
    device_grxsts_data_t data = { .d32 = xmc_device.global_register->grxstsp };

	switch (data.b.pktsts) {
	case USB_GRXSTS_PktSts_GOutNAK:
		break;
	case USB_GRXSTS_PktSts_OutCmpl:
		break;
	case USB_GRXSTS_PktSts_OutData:
		USB_ReadFifo(data.b.epnum,data.b.bcnt);
		break;
	case USB_GRXSTS_PktSts_Setup:
		USB_ReadFifo(data.b.epnum,data.b.bcnt);
		break;
	case USB_GRXSTS_PktSts_SetupCmpl:
		break;
	}
	/* no need to clear */
}

/**
 * \brief Handle OTG Interrupt
 *
 * It detects especially connect and disconnect events.
 */
void USB_HandleOTGInt() {
  gotgint_data_t data = { .d32 = xmc_device.global_register->gotgint }, clear = { .d32 = 0};
  if (data.b.sesenddet)
  {
    xmc_device.IsPowered = 0;
	xmc_device.DeviceEvent_cb(USB_USBD_EVENT_POWER_OFF);
	clear.d32 = 0;
	clear.b.sesenddet = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
  if (data.b.sesreqsucstschng) {
	clear.d32 = 0;
	clear.b.sesreqsucstschng = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
  if (data.b.hstnegsucstschng) {
	clear.d32 = 0;
	clear.b.hstnegsucstschng = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
  if (data.b.hstnegdet) {
	clear.d32 = 0;
	clear.b.hstnegdet = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
  if (data.b.adevtoutchng) {
	clear.d32 = 0;
	clear.b.adevtoutchng = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
  if (data.b.debdone) {
	clear.d32 = 0;
	clear.b.debdone = 1;
	xmc_device.global_register->gotgint = clear.d32;
  }
}

/**
 * \brief Global interrupt handler
 *
 * The handler first checks, which global interrupt has caused the interrupt
 * and then dispatches interrupt to the corresponding sub-handler.
 */
void USB_HandleIrq() {
  gintmsk_data_t gintmsk = { .d32 = xmc_device.global_register->gintmsk };
  gintsts_data_t data = { .d32 = xmc_device.global_register->gintsts & gintmsk.d32  };
  gintsts_data_t clear;
  if (data.b.sofintr)
  {
#ifdef DAVE_CE
    xmc_device.DeviceEvent_cb(USB_USBD_EVENT_SOF);
#endif
    clear.d32 = 0;
	clear.b.sofintr = 1;
	xmc_device.global_register->gintsts = clear.d32;
  }
  if(use_fifo)
  {
	if (data.b.rxstsqlvl)
	{
		/* Masked that interrupt so its only done once */
		gintmsk.b.rxstsqlvl = 0;
		xmc_device.global_register->gintmsk = gintmsk.d32;
		USB_HandleRxFLvl(); /* handle the interrupt */
		gintmsk.b.rxstsqlvl = 1;
		xmc_device.global_register->gintmsk = gintmsk.d32;
	}
  }
  if (data.b.erlysuspend)
  {
    clear.d32 = 0;
	clear.b.erlysuspend = 1;
	xmc_device.global_register->gintsts = clear.d32;
  }
  if (data.b.usbsuspend)
  {
	xmc_device.DeviceEvent_cb(USB_USBD_EVENT_SUSPEND);
	clear.d32 = 0;
	clear.b.usbsuspend = 1;
	xmc_device.global_register->gintsts = clear.d32;
  }
  if (data.b.wkupintr)
  {
	xmc_device.DeviceEvent_cb(USB_USBD_EVENT_RESUME);
	clear.d32 = 0;
	clear.b.wkupintr = 1;
	xmc_device.global_register->gintsts = clear.d32;
  }
  if (data.b.sessreqintr)
  {
	xmc_device.IsPowered = 1;
	xmc_device.DeviceEvent_cb(USB_USBD_EVENT_POWER_ON);
	clear.d32 = 0;
	clear.b.sessreqintr = 1;
	xmc_device.global_register->gintsts = clear.d32;
  }
  if (data.b.usbreset)
    USB_HandleUSBReset();
  if (data.b.enumdone)
	USB_HandleEnumDone();
  if (data.b.inepint)
	USB_HandleIEPInt();
  if (data.b.outepintr)
	USB_HandleOEPInt();
  if (data.b.otgintr)
	USB_HandleOTGInt();
}

/**
 * \brief Entry point for exception vector table
 *
 * This function gets called, if an usb exception (interrupt) was thrown and
 * dispatches it to \ref USB_HandleIrq.
 */
void USB0_0_IRQHandler() {
	USB_HandleIrq();
}

/**
 * \brief  Enables and sets the priority of USB Interrupt
 *
 * First the interrupt priority is set and then the interrupt is enabled in the NVIC.
 */
static void USB_EnableUSBInterrupt(void)
{
  NVIC_SetPriority(USB0_0_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),usb_preemption_priority,
		  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  	  usb_sub_priority));
  NVIC_ClearPendingIRQ(USB0_0_IRQn);
  NVIC_EnableIRQ(USB0_0_IRQn);
}

/**
 * \brief Disables the usb interrupt in the NVIC.
 *
 * Before the interrupt gets disabled, it will also be cleared.
 */
static void USB_DisableUSBInterrupt(void)
{
  NVIC_ClearPendingIRQ(USB0_0_IRQn);
  NVIC_DisableIRQ(USB0_0_IRQn);
}

/**
 * \brief Get the capabilities of the driver
 *
 * \return Driver capabilities
 */

USB_USBD_CAPABILITIES_t USB_GetCapabilities() {
  USB_USBD_CAPABILITIES_t cap;
  cap.event_connect = 1;
  cap.event_disconnect = 1;
#if UC_SERIES == 45
  cap.event_power_off = 1;
  cap.event_power_on = 1;
#else
  cap.event_power_off = 0;
  cap.event_power_on = 0;
#endif
  cap.event_high_speed = 0;
  cap.event_remote_wakeup = 1;
  cap.event_reset = 1;
  cap.event_resume = 1;
  cap.event_suspend = 1;
  cap.reserved = 0;
  return cap;
}
/**
 * \brief initialize the device to get ready to connect
 *
 * \param[in] cb_xmc_device_event Device event callback function pointer
 * \param[in] cb_endpoint_event Endpoint event callback function pointer
 *
 * \return Status of the function (See \ref USB_USBD_STATUS_t).
 */

USB_USBD_STATUS_t USB_Init(USB_USBD_SignalDeviceEvent_t cb_xmc_device_event,
												USB_USBD_SignalEndpointEvent_t cb_endpoint_event, USB_INIT_t init)
{


  /* RX Fifo size for packets all byte values devided by 4, because the fifo values are dw (4Byte) based. */
  usb_rx_fifo_packet_size=( init.usb_max_num_packets_in_rx_fifo*((USB_MAX_PACKET_SIZE/4 )+ 1) );

