thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
  /* Overall rx fifo size */
  usb_rx_fifo_size=( (4*init.usb_max_num_control_eps+ 6) + usb_rx_fifo_packet_size + (2*init.usb_max_num_out_eps) +1 );

  /* Maximum number of Endpoints */
  usb_max_num_eps=init.usb_max_num_eps;

  /* Transfer mode */
  if(init.usb_transfer_mode==USB_USE_DMA)
  {
	use_dma=1;
	use_fifo=0;
  }
  if(init.usb_transfer_mode==USB_USE_FIFO)
  {
  	use_dma=0;
  	use_fifo=1;
  }

  XMC_ASSERT("USB_Init: init.usb_max_num_control_eps not of type USB_MAX_NUM_CONTROL_EPS_t",
		  USB_CHECK_INPUT_MAX_NUM_CONTROL_EPS(init.usb_max_num_control_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_out_eps not of type USB_MAX_NUM_OUT_EPS_t",
 		  USB_CHECK_INPUT_MAX_NUM_OUT_EPS(init.usb_max_num_out_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_in_eps not of type USB_MAX_NUM_IN_EPS_t",
 		  USB_CHECK_INPUT_MAX_NUM_IN_EPS(init.usb_max_num_in_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_eps not of type USB_MAX_NUM_EPS_t",
 		  USB_CHECK_INPUT_MAX_NUM_EPS(init.usb_max_num_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_eps not of type USB_MAX_NUM_EPS_t",
		  ((usb_rx_fifo_size+(USB_EP0_TX_FIFO_SIZE/4)+(USB_EP1_TX_FIFO_SIZE/4)+(USB_EP2_TX_FIFO_SIZE/4)+
		  (USB_EP3_TX_FIFO_SIZE/4)+(USB_EP4_TX_FIFO_SIZE/4)+(USB_EP5_TX_FIFO_SIZE/4)+(USB_EP6_TX_FIFO_SIZE/4))>
  	  	  (USB_MAX_FIFO_SIZE/4)) );

  int i;

  /* out buffer size */
  USBD_EP_OUT_BUFFERSIZE = (uint32_t*)malloc(sizeof(uint32_t)*(usb_max_num_eps));
  /* in buffer size */
  USBD_EP_IN_BUFFERSIZE = (uint32_t*)malloc(sizeof(uint32_t)*(usb_max_num_eps));

  memset(USBD_EP_OUT_BUFFERSIZE,0x0,sizeof(uint32_t)*(usb_max_num_eps));
  memset(USBD_EP_IN_BUFFERSIZE,0x0,sizeof(uint32_t)*(usb_max_num_eps));

  /* Filling out buffer size */
    USBD_EP_OUT_BUFFERSIZE[0]=USB_EP0_BUFFER_SIZE;
  if( usb_max_num_eps>1)
    USBD_EP_OUT_BUFFERSIZE[1]=USB_EP1_BUFFER_SIZE;
  if( usb_max_num_eps>2)
    USBD_EP_OUT_BUFFERSIZE[2]=USB_EP2_BUFFER_SIZE;
  if( usb_max_num_eps>3)
    USBD_EP_OUT_BUFFERSIZE[3]=USB_EP3_BUFFER_SIZE;
  if( usb_max_num_eps>4)
    USBD_EP_OUT_BUFFERSIZE[4]=USB_EP4_BUFFER_SIZE;
  if( usb_max_num_eps>5)
    USBD_EP_OUT_BUFFERSIZE[5]=USB_EP5_BUFFER_SIZE;
  if( usb_max_num_eps>6)
    USBD_EP_OUT_BUFFERSIZE[6]=USB_EP6_BUFFER_SIZE;

  /* Filling out buffer size */
  USBD_EP_IN_BUFFERSIZE[0]=USB_EP0_BUFFER_SIZE;
  if( usb_max_num_eps>1)
    USBD_EP_IN_BUFFERSIZE[1]=USB_EP1_BUFFER_SIZE;
  if( usb_max_num_eps>2)
    USBD_EP_IN_BUFFERSIZE[2]=USB_EP2_BUFFER_SIZE;
  if( usb_max_num_eps>3)
    USBD_EP_IN_BUFFERSIZE[3]=USB_EP3_BUFFER_SIZE;
  if( usb_max_num_eps>4)
    USBD_EP_IN_BUFFERSIZE[4]=USB_EP4_BUFFER_SIZE;
  if( usb_max_num_eps>5)
    USBD_EP_IN_BUFFERSIZE[5]=USB_EP5_BUFFER_SIZE;
  if( usb_max_num_eps>6)
    USBD_EP_IN_BUFFERSIZE[6]=USB_EP6_BUFFER_SIZE;

  /* clear device status */
  memset(&xmc_device,0x0,sizeof(USB_DEVICE_t));

  /* assign callbacks */
  xmc_device.DeviceEvent_cb = cb_xmc_device_event;
  xmc_device.EndpointEvent_cb = cb_endpoint_event;

  /* assign register address */
  xmc_device.global_register = (dwc_otg_core_global_regs_t*)(USB_BASE_ADDRESS);
  xmc_device.device_register = ((dwc_otg_device_global_regs_t*)(USB_BASE_ADDRESS + DWC_DEV_GLOBAL_REG_OFFSET));
  for (i=0;i< USB_NUM_EPS;i++)
  {
    xmc_device.endpoint_in_register[i] = (dwc_otg_dev_in_ep_regs_t*)(USB_BASE_ADDRESS + DWC_DEV_IN_EP_REG_OFFSET +
    (DWC_EP_REG_OFFSET*i));
  }
  for (i=0;i< USB_NUM_EPS;i++)
  {
    xmc_device.endpoint_out_register[i] = (dwc_otg_dev_out_ep_regs_t*)(USB_BASE_ADDRESS + DWC_DEV_OUT_EP_REG_OFFSET +
    (DWC_EP_REG_OFFSET*i));
  }
  for (i=0;i<USB_NUM_TX_FIFOS;i++)
    xmc_device.fifo[i] = (uint32_t*)(USB_BASE_ADDRESS + USB_TX_FIFO_REG_OFFSET +
    (i*USB_TX_FIFO_OFFSET));

  /* Init data structure for endpoint 0 */
  /* Done by driver core */
  /* configure ahb details */
  gahbcfg_data_t gahbcfg = { .d32 = xmc_device.global_register->gahbcfg };
  gahbcfg.b.glblintrmsk = 1; /* enable interrupts ( global mask ) */
  gahbcfg.b.nptxfemplvl_txfemplvl = 1;
  /* enable dma if needed */
  if(use_dma)
  {
    gahbcfg.b.dmaenable = 1; /* enable dma if needed */
  }
  else
  {
    gahbcfg.b.dmaenable = 0;
  }
  xmc_device.global_register->gahbcfg = gahbcfg.d32;
  /* configure usb details */
  gusbcfg_data_t gusbcfg =  { .d32 = xmc_device.global_register->gusbcfg };
  gusbcfg.b.force_dev_mode = 1; /* force us into device mode */
  gusbcfg.b.srpcap = 1; /* enable session request protocoll */
  xmc_device.global_register->gusbcfg = gusbcfg.d32;

  /* Device init */
  /* configure device speed */
  dcfg_data_t dcfg = { .d32 = xmc_device.device_register->dcfg };
  dcfg.b.devspd = USB_DCFG_DevSpd_FS;
  dcfg.b.descdma = 0;
  xmc_device.device_register->dcfg = dcfg.d32;
  /* configure device functions */
  dctl_data_t dctl = { .d32 = xmc_device.device_register->dctl };
  dctl.b.sftdiscon = 1; /* disconnect the device until its connected by the user */
  /* all other config is done by default register value */
  xmc_device.device_register->dctl = dctl.d32;

  /* Configure fifos */
  /* Calculate the size of the rx fifo */
  xmc_device.global_register->grxfsiz = usb_rx_fifo_size;
  /* Calculate the size of the tx fifo for ep 0 */
  fifosize_data_t gnptxfsiz = { .d32 = 0 };
  gnptxfsiz.b.depth = USB_TX_FIFO_SIZE[0];
  gnptxfsiz.b.startaddr = usb_rx_fifo_size;
  xmc_device.global_register->gnptxfsiz = gnptxfsiz.d32;
  /* calculate the size for the rest */
  fifosize_data_t dtxfsiz = { .b.depth = USB_TX_FIFO_SIZE[1], .b.startaddr = usb_rx_fifo_size + USB_TX_FIFO_SIZE[0]};
  for (i=1;i<USB_NUM_TX_FIFOS;i++)
  {
    xmc_device.global_register->dtxfsiz[i-1] = dtxfsiz.d32;
    /* leave loop for overrun protection */
    if (i==USB_NUM_TX_FIFOS-1)
      break;
    dtxfsiz.b.depth = USB_TX_FIFO_SIZE[i+1];
    dtxfsiz.b.startaddr += USB_TX_FIFO_SIZE[i];
  }
  /* flush the fifos for proper operation */
  USB_FlushTXFifo(0x10); /* 0x10 == all fifos, see doc */
  USB_FlushRXFifo();
  /* Enable Global Interrupts */
  /* clear interrupt status bits prior to unmasking */
  xmc_device.global_register->gintmsk = 0; /* diable all interrupts */
  xmc_device.global_register->gintsts = 0xFFFFFFFF; /* clear all interrupts */
  gintmsk_data_t gintmsk = { .d32 = 0 };
  /* enable common interrupts */
  gintmsk.b.modemismatch = 1;
  gintmsk.b.otgintr = 1;
  gintmsk.b.sessreqintr = 1;
  /* enable device interrupts */
  gintmsk.b.usbreset = 1;
  gintmsk.b.enumdone = 1;
  gintmsk.b.erlysuspend = 1;
  gintmsk.b.usbsuspend = 1;
  gintmsk.b.wkupintr = 1;
  gintmsk.b.sofintr = 1;
  if(use_fifo)
  {
	gintmsk.b.rxstsqlvl = 1;
  }
  gintmsk.b.outepintr = 1;
  gintmsk.b.inepintr = 1;
  xmc_device.global_register->gintmsk = gintmsk.d32;
  /* Enable Interrupts in NVIC */
  USB_EnableUSBInterrupt();
  return USB_USBD_OK;
}

USB_USBD_STATUS_t USB_Uninitialize() {
  USB_DisableUSBInterrupt();
  /* Disconnect the device */
  dctl_data_t dctl = { .d32 = xmc_device.device_register->dctl };
  dctl.b.sftdiscon = 1;
  xmc_device.device_register->dctl = dctl.d32;
  /* Release all memory, if malloc is used */
  uint8_t i;
  for (i=0; i< usb_max_num_eps; i++) {
    xmc_usb_ep_t *ep = &xmc_device.ep[i];
    if (ep->inBufferSize>0 && ep->inBuffer != 0)
    {
    	free(ep->inBuffer);
    }
    if (ep->outBufferSize>0 && ep->outBuffer != 0)
    {
    	free(ep->outBuffer);
    }
  }
  /* clean up */
  memset(&xmc_device,0,sizeof(xmc_device));
  return USB_USBD_OK;
}



USB_USBD_STATUS_t USB_DeviceConnect() {
  /* Just disable softdisconnect */
  dctl_data_t dctl = { .d32 = xmc_device.device_register->dctl };
  dctl.b.sftdiscon = 0;
  xmc_device.device_register->dctl = dctl.d32;
  return USB_USBD_OK;
}

USB_USBD_STATUS_t USB_DeviceDisconnect() {
  dctl_data_t dctl = { .d32 = xmc_device.device_register->dctl };
  dctl.b.sftdiscon = 1;
  xmc_device.device_register->dctl = dctl.d32;
  return USB_USBD_OK;
}

