thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
USB_USBD_STATE_t USB_DeviceGetState() {
  USB_USBD_STATE_t state;
  state.speed = USB_SPEED_FULL;
  state.connected = xmc_device.IsConnected;
  state.active = USB_DeviceActive();
  state.powered = xmc_device.IsPowered;
  return state;
}


USB_USBD_STATUS_t USB_EndpointReadStart(uint8_t ep_addr,uint8_t * buffer,uint32_t size) {
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_addr & USB_EP_NUM_MASK];
  if (ep->outInUse || !ep->isConfigured)
    return USB_USBD_ERROR;
  /* short the length to buffer size if needed */
  if (size > ep->outBufferSize)
    size = ep->outBufferSize;
  /* set ep values */
  ep->xferTotal = size;
  ep->xferCount = 0;
  ep->xferLength = 0;
  ep->xferBuffer = ep->outBuffer;
  ep->outBytesAvailable = 0;
  USB_StartReadXfer(ep);
  return USB_USBD_OK;
}

int32_t USB_EndpointRead(uint8_t ep_num,uint8_t * buffer,uint32_t length) {
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_num];
  if (length > ep->outBytesAvailable)
	length = ep->outBytesAvailable;
  memcpy(buffer,&ep->outBuffer[ep->outOffset],length);
  ep->outBytesAvailable -= length;
  if (ep->outBytesAvailable)
	ep->outOffset += length;
  else
	ep->outOffset = 0;
  return length;
}

int32_t USB_EndpointWrite(uint8_t ep_num,const uint8_t * buffer,uint32_t length) {
  xmc_usb_ep_t * ep = &xmc_device.ep[ep_num & USB_EP_NUM_MASK];
  if (!ep->isConfigured)
    return USB_USBD_ERROR;
  if (ep->inInUse == 1)
    return 0;
    if (length > ep->inBufferSize)
	  length = ep->inBufferSize;
	/* copy data into input buffer for dma and fifo mode */
	memcpy(ep->inBuffer,buffer,length);
	ep->xferBuffer = ep->inBuffer;
  ep->xferTotal = length;
  /* set transfer values */
  ep->xferLength = 0;
  ep->xferCount = 0;
  ep->inInUse = 1;
  /* start the transfer */
  USB_StartWriteXfer(ep);
  return (int32_t)ep->xferTotal;
}

USB_USBD_STATUS_t USB_DeviceSetAddress(uint8_t address,USB_USBD_SET_ADDRESS_STAGE_t stage) {
  dcfg_data_t data = { .d32 = xmc_device.device_register->dcfg };
  if (stage == USB_USBD_SET_ADDRESS_SETUP)
  {
    data.b.devaddr = address;
    xmc_device.device_register->dcfg = data.d32;
  }
	return USB_USBD_OK;
}

USB_USBD_STATUS_t USB_EndpointStall(uint8_t ep_addr, bool stall) {
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_addr & USB_EP_NUM_MASK];
  if (stall)
  {
    ep->isStalled = 1;
	if (ep_addr & USB_USB_ENDPOINT_DIRECTION_MASK)
	{
	  /* if ep is enabled, disable ep and set stall bit */
	  depctl_data_t data = { .d32 = xmc_device.endpoint_in_register[ep->number]->diepctl };
	  if (data.b.epena)
	  {
	    data.b.epdis = 1;
	  }
	data.b.stall = 1;
	xmc_device.endpoint_in_register[ep->number]->diepctl = data.d32;
	}
	else
	{
	  /* just set stall bit */
	  depctl_data_t data = { .d32 = xmc_device.endpoint_out_register[ep->number]->doepctl };
	  data.b.stall = 1;
	  xmc_device.endpoint_out_register[ep->number]->doepctl = data.d32;
	}
  }
  else
  {
    /* just clear stall bit */
	ep->isStalled = 0;
	if (ep_addr & USB_USB_ENDPOINT_DIRECTION_MASK)
	{
	  depctl_data_t data = { .d32 = xmc_device.endpoint_in_register[ep->number]->diepctl };
	  data.b.stall = 0;
	  data.b.setd0pid = 1; /* reset pid to 0 */
	  xmc_device.endpoint_in_register[ep->number]->diepctl = data.d32;
	}
	else
	{
	  depctl_data_t data = { .d32 = xmc_device.endpoint_out_register[ep->number]->doepctl };
	  data.b.stall = 0;
	  data.b.setd0pid = 1; /* reset pid to 0 */
	  xmc_device.endpoint_out_register[ep->number]->doepctl = data.d32;
	}
  }
return USB_USBD_OK;
}

USB_USBD_STATUS_t USB_EndpointAbort(uint8_t ep_addr) {
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_addr & USB_USB_ENDPOINT_NUMBER_MASK];
  uint32_t i;
  if (ep->direction || ep->type == USB_EP_TYPE_Control)
  {
    ep->inInUse = 0;
	depctl_data_t data = { .d32 = xmc_device.endpoint_in_register[ep->number]->diepctl};
	data.b.stall = 0;
	data.b.setd0pid = 0;
	if (ep->number != 0)
	  data.b.epdis = 1;
	data.b.snak = 1;
	xmc_device.endpoint_in_register[ep->number]->diepctl = data.d32;
  }
  if (!ep->direction || ep->type == USB_EP_TYPE_Control)
  {
    ep->outInUse = 0;
	depctl_data_t data = { .d32 = xmc_device.endpoint_out_register[ep->number]->doepctl};
	data.b.stall = 0;
	data.b.setd0pid = 0;
	if (ep->number != 0)
	  data.b.epdis = 1;
	data.b.snak = 1;
	xmc_device.endpoint_out_register[ep->number]->doepctl = data.d32;
  }
  USB_FlushTXFifo(ep->txFifoNum);
  if(use_fifo)
  {
	device_grxsts_data_t grx = { .d32 = xmc_device.global_register->grxstsr};
	while (grx.b.epnum==ep->number && grx.b.bcnt > 0)
	{
		grx.d32 = xmc_device.global_register->grxstsp;
		for (i=0;i< ((grx.b.bcnt+3) >> 2 );i++)
		{
			*xmc_device.fifo[0];
		}
		grx.d32 = xmc_device.global_register->grxstsr;
	}
   }
  ep->isStalled = 0;
  ep->outBytesAvailable = 0;
  ep->outOffset = 0;
  ep->xferLength = 0;
  ep->xferCount = 0;
  ep->xferTotal = 0;
  return USB_USBD_OK;
}

USB_USBD_STATUS_t USB_EndpointConfigure(uint8_t ep_addr,USB_ENDPOINT_TYPE_t ep_type,
		uint16_t ep_max_packet_size,USB_INIT_t init) {

  XMC_ASSERT("USB_Init: init.usb_max_num_control_eps not of type USB_MAX_NUM_CONTROL_EPS_t",
			 USB_CHECK_INPUT_MAX_NUM_CONTROL_EPS(init.usb_max_num_control_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_out_eps not of type USB_MAX_NUM_OUT_EPS_t",
	 		 USB_CHECK_INPUT_MAX_NUM_OUT_EPS(init.usb_max_num_out_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_in_eps not of type USB_MAX_NUM_IN_EPS_t",
	 		 USB_CHECK_INPUT_MAX_NUM_IN_EPS(init.usb_max_num_in_eps));
  XMC_ASSERT("USB_Init: init.usb_max_num_eps not of type USB_MAX_NUM_EPS_t",
	 		 USB_CHECK_INPUT_MAX_NUM_EPS(init.usb_max_num_eps));

  daint_data_t daintmsk = { .d32 = xmc_device.device_register->daintmsk };
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_addr & USB_USB_ENDPOINT_NUMBER_MASK];
  memset(ep,0x0,sizeof(xmc_usb_ep_t)); /* clear endpoint structure */
  /* do ep configuration */
  ep->address = ep_addr;
  ep->isConfigured = 1;
  ep->maxPacketSize = ep_max_packet_size;
  if (ep->address != 0)
    ep->maxTransferSize = USB_MAX_TRANSFER_SIZE;
  else
    ep->maxTransferSize = USB_MAX_TRANSFER_SIZE_EP0;
  /* transfer buffer */
  ep->inBuffer =  (uint8_t*)malloc(USBD_EP_IN_BUFFERSIZE[ep->number]);
  ep->outBuffer = (uint8_t*)malloc(USBD_EP_OUT_BUFFERSIZE[ep->number]);

  ep->inBufferSize = USBD_EP_IN_BUFFERSIZE[ep->number];
  ep->outBufferSize = USBD_EP_OUT_BUFFERSIZE[ep->number];
  /* is in */
  if (ep->direction == 1 || ep_type == USB_ENDPOINT_CONTROL)
  {
    depctl_data_t data = { .d32 = xmc_device.endpoint_in_register[ep->number]->diepctl };
	/*enable endpoint */
	data.b.usbactep = 1;
	/* set ep type */
	data.b.eptype = ep_type;
	/* set mps */
	data.b.mps = ep_max_packet_size;
	/* set first data0 pid */
	data.b.setd0pid = 1;
	/* clear stall */
	data.b.stall = 0;
	/* set tx fifo */
	ep->txFifoNum = USB_AssignTXFifo(); /* get tx fifo */
	data.b.txfnum = ep->txFifoNum;
	xmc_device.endpoint_in_register[ep->number]->diepctl = data.d32; /* configure endpoint */
	daintmsk.ep.in |= (1<<ep->number); /* enable interrupts for endpoint */
  }
  if (ep->direction == 0 || ep_type == USB_ENDPOINT_CONTROL)
  {
    /* is out */
	depctl_data_t data = { .d32 = xmc_device.endpoint_out_register[ep->number]->doepctl };
	/*enable endpoint */
	data.b.usbactep = 1;
	/* set ep type */
	data.b.eptype = ep_type;
	/* set mps */
	data.b.mps = ep_max_packet_size;
	/* set first data0 pid */
	data.b.setd0pid = 1;
	/* clear stall */
	data.b.stall = 0;
	xmc_device.endpoint_out_register[ep->number]->doepctl = data.d32; /* configure endpoint */
	daintmsk.ep.out |= (1<<ep->number); /* enable interrupts */
  }
  xmc_device.device_register->daintmsk = daintmsk.d32;
  return USB_USBD_OK;
}

