thesourcerer8/Flying-PCB/Software/LARIX_Software_150907/Dave/Model/USBD_LLD/1.0.0/Templates/driver/xmc4_usb.c
USB_USBD_STATUS_t USB_EndpointUnconfigure(uint8_t ep_addr) {
  xmc_usb_ep_t *ep = &xmc_device.ep[ep_addr & USB_USB_ENDPOINT_NUMBER_MASK];
  depctl_data_t data = { .d32 = 0 };
  daint_data_t daintmsk = { .d32 = xmc_device.device_register->daintmsk };

  /* if not configured return an error */
  if (!ep->isConfigured)
    return USB_USBD_ERROR;

  /* disable the endpoint, deactivate it and only send naks */
  data.b.usbactep = 0;
  data.b.epdis = 1;
  data.b.snak = 1;
  data.b.stall = 0;
  /* free memory */
  if (ep->inBufferSize>0 && ep->inBuffer != 0)
  {
	  free(ep->inBuffer);
  }
  if (ep->outBufferSize>0 && ep->outBuffer != 0)
  {
    free(ep->outBuffer);
  }
  ep->isConfigured = 0;
  ep->isStalled = 0;
  ep->outInUse = 0;
  ep->inInUse = 0;

  /* chose register based on the direction. Control Endpoint need both */
  if (ep->direction == 1 || ep->type == USB_ENDPOINT_CONTROL)
  {
    xmc_device.endpoint_in_register[ep->number]->diepctl = data.d32; /* disable endpoint configuration */
    daintmsk.ep.in &= ~(1 << ep->number); /* disable interrupts */
  }
  if (ep->direction == 0 || ep->type == USB_ENDPOINT_CONTROL)
  {
    xmc_device.endpoint_out_register[ep->number]->doepctl = data.d32;
    daintmsk.ep.out &= ~(1 << ep->number);
    if(use_fifo)
    {
      xmc_device.device_register->dtknqr4_fifoemptymsk &= ~(1<<ep->number);
    }
  }
  xmc_device.device_register->daintmsk = daintmsk.d32;
  USB_UnassignFifo(ep->txFifoNum); /* free fifo */
  return USB_USBD_OK;
}

uint16_t USB_GetFrameNumber(void) {
  dsts_data_t dsts = { .d32 = xmc_device.device_register->dsts };
  return dsts.b.soffn;
}

USB_USBD_ENUM_t USB_IsEnumDone(void){
 gintmsk_data_t data = { .d32 = xmc_device.global_register->gintmsk };
 if (data.b.enumdone)
 {
  return USB_USBD_EVENT_ENUM_DONE;
 }
 else
 {
  return USB_USBD_EVENT_ENUM_NOT_DONE;
 }
}


